src/Catalogs/Scan_Изделия/Scan_Изделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Изделия</name>
  <attributes>
    <name>DLV</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystemProduct</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аренда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИзделийOFMS</name>
    <type>
      <types>EnumRef.Scan_ГруппыИзделийOFMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИстеченияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Демо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДемоИТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСКлиентомНакладнаяУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановкиПлановыхЦенПродукта</name>
    <type>
      <types>DocumentRef.Scan_УстановкаПлановыхЦенПродукта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Замечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиваемоеМестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретИзмененияСкладаПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентПродукта</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСоглашенияОПоставке</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДатаУстраненияНедостатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйСтатусПродукта</name>
    <type>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПродукта</name>
    <type>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателяТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукта</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Надстр_Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьЛогистическиеТипыИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьМоделиИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРазрешеноМенятьСрокУстраненияНедостатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДвигателяТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИзделия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОСАГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭРАГЛОНАСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортОтправки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрихода</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецПродукта</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьЛогистическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментРынкаПродуктов</name>
    <type>
      <types>CatalogRef.Scan_СегментыРынкаПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СОП</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияПродукта</name>
    <type>
      <types>CatalogRef.Scan_СпецификацииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУстраненияНедостатковДоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУСтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТахографСЗаводаСкания</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГИБДД</name>
    <type>
      <types>CatalogRef.Scan_ТипыГИБДД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>CatalogRef.Scan_ТипыКабинИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.Scan_ТипыКузова</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродуктаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТопливаДвигателя</name>
    <type>
      <types>CatalogRef.Scan_ТипыТопливаДвигателейПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТСПоПТС</name>
    <type>
      <types>CatalogRef.Scan_ТипыТСПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыМаркетинговые</name>
    <type>
      <types>CatalogRef.Scan_МаркетинговыеТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленныйТахограф</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабиныПТС</name>
    <type>
      <types>CatalogRef.Scan_ЦветаКабиныПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкологическийКласс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПТС</name>
    <type>
      <types>CatalogRef.Scan_ЭПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭраГлонассАктивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ЗамечанияПоАктамПриемоПередачи/Scan_ЗамечанияПоАктамПриемоПередачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗамечанияПоАктамПриемоПередачи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Устранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНеисправнойДетали</name>
    <type>
      <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДефекта</name>
    <type>
      <types>CatalogRef.Scan_КодыДефектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоОбнаружения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_КодыНеисправныхДеталей/Scan_КодыНеисправныхДеталей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_КодыНеисправныхДеталей</name>
  <predefined>
    <items>
      <name>Изделие</name>
      <description>Изделие</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДетали</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_Изделия/Forms/ФормаВводаЗамечаний/Module.bsl
&НаСервереБезКонтекста
Процедура ПолучитьСписокКодовНеисправностей(СписокКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_КодыНеисправныхДеталей.КодДетали КАК КодДетали
	|ИЗ
	|	Справочник.Scan_КодыНеисправныхДеталей КАК Scan_КодыНеисправныхДеталей
	|
	|СГРУППИРОВАТЬ ПО
	|	Scan_КодыНеисправныхДеталей.КодДетали
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодДетали";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТабКодов = РезультатЗапроса.Выгрузить();
	Если ТабКодов.Количество() <> 0 Тогда
		Для Каждого ТекКод Из ТабКодов Цикл
			СписокКодов.Добавить(ТекКод.КодДетали, ТекКод.КодДетали);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСписокКодовДефектов(СписокКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_КодыДефектов.КодДефекта КАК КодДефекта
	|ИЗ
	|	Справочник.Scan_КодыДефектов КАК Scan_КодыДефектов
	|
	|СГРУППИРОВАТЬ ПО
	|	Scan_КодыДефектов.КодДефекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодДефекта";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТабКодов = РезультатЗапроса.Выгрузить();
	Если ТабКодов.Количество() <> 0 Тогда
		Для Каждого ТекКод Из ТабКодов Цикл
			СписокКодов.Добавить(ТекКод.КодДефекта, ТекКод.КодДефекта);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗамечаниеНовое()
	
	ВремЗамечание = "";
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Устранено",Ложь);
	НайденныеСтроки = ТабЗамечанияПоАктам.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаЗамечания Из НайденныеСтроки Цикл
		Если ВремЗамечание = "" Тогда
			ВремЗамечание = СокрЛП(СтрокаЗамечания.Замечание) + ?(ЗначениеЗаполнено(СтрокаЗамечания.Количество)," (" + СтрокаЗамечания.Количество + ")", "");
		Иначе
			ВремЗамечание = ВремЗамечание + ", " + СокрЛП(СтрокаЗамечания.Замечание) + ?(ЗначениеЗаполнено(СтрокаЗамечания.Количество)," (" + СтрокаЗамечания.Количество + ")", "");
		КонецЕсли;
	КонецЦикла;
	
	Если ВремЗамечание = "" Тогда
		ВремЗамечание = "НОРМА";
	КонецЕсли;
	Замечание = ВремЗамечание;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗамечаниеСтроки(ТекСтрока)
	
	Если ЗначениеЗаполнено(ТекСтрока.КодНеисправнойДетали) И ЗначениеЗаполнено(ТекСтрока.КодДефекта) Тогда
		Элементы.ТабЗамечанияПоАктамЗамечание.ТолькоПросмотр = Истина;
		Если ТекСтрока.КодНеисправнойДетали = ПредопределенноеЗначение("Справочник.Scan_КодыНеисправныхДеталей.Прочее") И
			ТекСтрока.КодДефекта = ПредопределенноеЗначение("Справочник.Scan_КодыДефектов.Прочее") Тогда
			
			Элементы.ТабЗамечанияПоАктамЗамечание.ТолькоПросмотр = Ложь;
			ТекСтрока.Замечание = ""; 
			Элементы.ТабЗамечанияПоАктамЗамечание.ПодсказкаВвода = "Текст произвольного замечания";
		Иначе
			ТекСтрока.Замечание = Строка(ТекСтрока.КодНеисправнойДетали) + " - " + ТекСтрока.КодДефекта;
			Элементы.ТабЗамечанияПоАктамЗамечание.ПодсказкаВвода = "";
		КонецЕсли;
	Иначе
		Элементы.ТабЗамечанияПоАктамЗамечание.ТолькоПросмотр = Истина;
		ТекСтрока.Замечание = "";	
		Элементы.ТабЗамечанияПоАктамЗамечание.ПодсказкаВвода = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНеисправностьПоКоду(Код)
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		Возврат Справочники.Scan_КодыНеисправныхДеталей.ПустаяСсылка();
	Иначе
		Возврат Справочники.Scan_КодыНеисправныхДеталей.НайтиПоРеквизиту("КодДетали", Код);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьКодПоНеисправности(Неисправность)
	
	Если Не ЗначениеЗаполнено(Неисправность) Тогда
		Возврат "";
	Иначе
		Возврат Неисправность.КодДетали;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДефектПоКоду(Код)
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		Возврат Справочники.Scan_КодыДефектов.ПустаяСсылка();
	Иначе
		Возврат Справочники.Scan_КодыДефектов.НайтиПоРеквизиту("КодДефекта", Код);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьКодПоДефекту(Дефект)
	
	Если Не ЗначениеЗаполнено(Дефект) Тогда
		Возврат "";
	Иначе
		Возврат Дефект.КодДефекта;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТабЗамечанияПоАктамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования
		И   Элемент.ТекущиеДанные <> Неопределено
		Тогда
		СформироватьЗамечаниеНовое();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если НоваяСтрока 
		И СокрЛП(ТекСтрока.МестоОбнаружения) = "" 
		И СокрЛП(ТекСтрока.Замечание) = "" 
		Тогда
		ТабЗамечанияПоАктам.Удалить(ТекСтрока);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамПослеУдаления(Элемент)
	
	Если ТабЗамечанияПоАктам.Количество() <> 0 Тогда
		СформироватьЗамечаниеНовое();
	Иначе
		Замечание = "";
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамКодНеисправностиКодПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабЗамечанияПоАктам.ТекущиеДанные;
	
	ТекДанные.КодНеисправнойДетали = ПолучитьНеисправностьПоКоду(ТекДанные.КодНеисправностиКод);
	СформироватьЗамечаниеСтроки(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамКодНеисправнойДеталиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабЗамечанияПоАктам.ТекущиеДанные;
	
	ТекДанные.КодНеисправностиКод = ПолучитьКодПоНеисправности(ТекДанные.КодНеисправнойДетали);
	СформироватьЗамечаниеСтроки(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамКодДефектаКодПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабЗамечанияПоАктам.ТекущиеДанные;
	
	ТекДанные.КодДефекта = ПолучитьДефектПоКоду(ТекДанные.КодДефектаКод);
	СформироватьЗамечаниеСтроки(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗамечанияПоАктамКодДефектаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабЗамечанияПоАктам.ТекущиеДанные;
	
	ТекДанные.КодДефектаКод = ПолучитьКодПоДефекту(ТекДанные.КодДефекта);
	СформироватьЗамечаниеСтроки(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторФормы = Параметры.ИдентификаторФормы;
	
	Продукт = Параметры.Продукт;
	
	Замечание                                  = Параметры.Замечание;
	КрайняяДатаУстраненияНедостатков           = Параметры.КрайняяДатаУстраненияНедостатков;
	НеРазрешеноМенятьСрокУстраненияНедостатков = Параметры.НеРазрешеноМенятьСрокУстраненияНедостатков;
	СрокУстраненияНедостатковДоп               = Параметры.СрокУстраненияНедостатковДоп;
	
	ТабЗамечанияПоАктам.Очистить();
	
	ДанныеИзРегистра = РегистрыСведений.Scan_ЗамечанияПоАктамПриемоПередачи.ПолучитьЗамечанияПоИзделиюИзРегистра(Продукт);
	Для Каждого СтрокаРегистра Из ДанныеИзРегистра Цикл
		НоваяСтрока = ТабЗамечанияПоАктам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРегистра);
	КонецЦикла;
	
	СписокКодовНеисправностей = Элементы.ТабЗамечанияПоАктамКодНеисправностиКод.СписокВыбора;
	ПолучитьСписокКодовНеисправностей(СписокКодовНеисправностей);
	СписокКодовДефектов = Элементы.ТабЗамечанияПоАктамКодДефектаКод.СписокВыбора;
	ПолучитьСписокКодовДефектов(СписокКодовДефектов);
	
	Элементы.НеРазрешеноМенятьСрокУстраненияНедостатков.Доступность = Scan_ПраваИНастройки.Scan_ПолучитьПраваИНастройкиПользователя(ПользователиКлиентСервер.ТекущийПользователь(),
	                                                                  ПланыВидовХарактеристик.Scan_ПраваИНастройки.РазрешитьИзменятьСрокУстраненияНедостатков);
																	  
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФото(Команда)
	
	Если Не ЗначениеЗаполнено(Продукт) Тогда
		Сообщить(НСтр("ru = 'Запишите продукт!'; en = 'Record the product!'"));
	КонецЕсли;
		
	РаботаСФайламиКлиент.ДобавитьФайлы(Продукт, ИдентификаторФормы, ,);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если ЗаписатьЗамечанияВРегистр() Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Замечание", Замечание);
		ПараметрыЗакрытия.Вставить("КрайняяДатаУстраненияНедостатков", КрайняяДатаУстраненияНедостатков);
		ПараметрыЗакрытия.Вставить("НеРазрешеноМенятьСрокУстраненияНедостатков", НеРазрешеноМенятьСрокУстраненияНедостатков);
		ПараметрыЗакрытия.Вставить("СрокУстраненияНедостатковДоп", СрокУстраненияНедостатковДоп);
		
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьЗамечанияВРегистр()
	
	ЕстьОшибки = Ложь;
	
	Для Индекс = 0 по ТабЗамечанияПоАктам.Количество()-1 Цикл
		ТекСтрокаЗамечания = ТабЗамечанияПоАктам.Получить(Индекс);
		Если Не ЗначениеЗаполнено(ТекСтрокаЗамечания.ДатаОбнаружения) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'В строке '; en = 'In line '") + (Индекс + 1) + НСтр("ru = ' не заполнена дата обнаружения.'; en = ' detection date is not filled.'");
			Сообщение.Поле = "ТабЗамечанияПоАктам[" + Индекс + "].ДатаОбнаружения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекСтрокаЗамечания.Замечание) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'В строке '; en = 'In line '") + (Индекс + 1) + НСтр("ru = ' не заполнено замечание. Проверьте корректность кода/наименования неисправности и дефекта.'; en = ' comment is not filled.'");
			Сообщение.Поле = "ТабЗамечанияПоАктам[" + Индекс + "].Замечание";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьОшибки Тогда
		РегистрыСведений.Scan_ЗамечанияПоАктамПриемоПередачи.ЗаписатьЗамечанияПоИзделиюВРегистр(Продукт, ТабЗамечанияПоАктам);
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура НеРазрешеноМенятьСрокУстраненияНедостатковПриИзменении(Элемент)
	
	НастроитьДопСрокУстраненияНедостатков();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДопСрокУстраненияНедостатков()
	
	Если НеРазрешеноМенятьСрокУстраненияНедостатков = Ложь Тогда
		Элементы.ГруппаСрокУстраненияНедостатковИПодсказка.Видимость = Истина;
	Иначе
		Элементы.ГруппаСрокУстраненияНедостатковИПодсказка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокУстраненияНедостатковДопПриИзменении(Элемент)
	
	СрокУстраненияНедостатковДопПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СрокУстраненияНедостатковДопПриИзмененииНаСервере()
	
	//Если ЗначениеЗаполнено(СрокУстраненияНедостатковДоп) Тогда	// rarus tenkam 03.02.2021 не работало для срока =0 
		КрайняяДата = Справочники.Scan_Изделия.ПересчитатьКрайнююДатуУстраненияНедостатков(Продукт, СрокУстраненияНедостатковДоп);
		Если КрайняяДата <> КрайняяДатаУстраненияНедостатков Тогда
			КрайняяДатаУстраненияНедостатков = КрайняяДата;
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДопСрокУстраненияНедостатков();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	Если ЗначениеЗаполнено(Продукт) Тогда
		Возврат;
	КонецЕсли;
	
	НеРазрешеноМенятьСрокУстраненияНедостатков                   = Истина;
	Элементы.ГруппаСрокУстраненияНедостатковИПодсказка.Видимость = Ложь;
	
КонецПроцедуры
